---
kind: property
id: P:Autodesk.Revit.DB.FabricationDimensionDefinition.IsModifiable
source: html/56534596-a05a-0260-ed0b-1b6956f7580a.htm
---
# Autodesk.Revit.DB.FabricationDimensionDefinition.IsModifiable Property

If the fabrication dimension is modifiable by user.

## Syntax (C#)
```csharp
public bool IsModifiable { get; }
```